[
  "Hey hey heeeeeeeeeey!",
  "Hey hey heeeeeeeeeey... Hey hey heeeeeeeeeey... Hey hey heeeeeeeeeey.",
  "What's-a what's-a what's-a what's-a what's-a what's-a what's-a what's-a what's UP?!",
  "What's-a what's-a what's-a what's-a what's-a what's-a what's-a what's-a what's UP, BITCONNEEEEEEEEEEEECT!",
  "BITCONNEEEEEEEEEEEECT!",
  "Hey hey hey.",
  "Hey hey hey everybody, My name is Carlos Matos and I am coming from New York City, New York.",
  "Let me tell you guys that I am SO EXCITED, I am SO HAPPY I am really so thrilled to be right now sharing this amazing, glorious, SUPER and EXCITING moment of my life with all of you guys.",
  "Let me tell you that we are really changing the WORLD as we know it.",
  "The WORLD is not anymore the way it used to be, mm mm MM, NO NO NOH!",
  "Mm mm MM, NO NO NOH!",
  "BitcoNNEEEEEEEEEEEEEEEEECT WOOOoo!",
  "BitcoNNEEEEEEEEEEEEEEEEECT!",
  "BitconnEEEEEEEEEEEEEEEEEEEEECT!",
  "We are coming and we are coming in waves.",
  "We are starting and to actually go all over the world.",
  "We all built in the entire world.",
  "Let me tell you guys that I started 137 days ago, with only 25 thousand six hundred and ten dollars -and right now I am reaching one hundred and forty THOUSAND dollars.",
  "WOAH WOAH WOAH WOAH WOAH WOAH WOAH WHAT'S UP!",
  "And let me tell you that I am actually earning around one hundred mil- I mean around one thousand four hundred dollars on an everyday basis seven days a week WHAT?!!?",
  "WHAT?!!?",
  "I am right now independently, financially independently.",
  "I am saying to so many people who say that this is going to be a con artist game, that this was gonna be a scammer game: \"Hey, you are gonna lose all your mone-\".",
  "My WIFE still doesn't believe in me!",
  "I'm telling her \"Well honey this is real\".",
  "\"No no no no no no, that's a scam!\".",
  "And I say \"But wait I'm gonna go to the banks, I'm gonna get my bitcoins, I'm gonna actually put it into dollars, here they are right on the table!\".",
  "\"Aww, that's money that you took from one of the accounts!\".",
  "I say: \"What am I gonna do?\".",
  "Then I said to myself, \"You know what? When I started to put ten thousand dollars a day on her, right on her, y'know on her table\".",
  "Then she's gonna say: \"WOOOOW.\" HA-HA-HA-HA-h. \"YEAYEYEYEYEYE OK, THAT'S REAL!\".",
  "HAHAHAHAH!",
  "So guys, I wanna tell you something: Faith and belief is the one thing we will need to be able to change the world.",
  "And right now, I believe, that in this room, we have the seed, that's gonna germinate, and that is going to EXPLODE, into an AMMMAZING opportunity for us to change this entire world.",
  "I am so proud, I am so honored, I am so EXCITED to be here right now.",
  "And hey let me tell you something, that each and every one of YOU, has the opportunity to become, like those amazing people that we know here FROM VIETNAM!",
  "Making so much money that they can probably have a real hard time counting it!",
  "WheezeAHAHAHAHAHAh!",
  "So GUYS, let me tell you: I LOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOVE BITCONEEEEEEECT!",
  "I LOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOOVE BITCONEEEEEEECT!"
]
