{
  "recipes": [
    {
      "name": "Peach melba pop pies",
      "ingredients": "200g raspberries\n\n410g can peach slices in fruit juice, drained and chopped\n\n1 tbsp cornflour\n\n1 tbsp honey\n\n2 x 320g shortcrust pastry sheet\n\n1 egg, beaten\n\n150g icing sugar\n\nfreeze-dried raspberries or sprinkles, optional",
      "method": "1. Set 6 plump raspberries aside and tip the rest into a bowl. Add the peaches and toss together. In a small bowl mix the cornflour and honey to make a paste, pour over the fruit and combine.\n\n2. Unroll the pastry sheets and use a pizza wheel to cut out 6 rectangles from each one. Turn a piece of pastry so the long side is nearest to you, and fold it in half like a book, to create a fold down the middle. Open the pastry out and spoon the fruit filling onto one side, leaving a border of about 1cm around the edge. Brush the beaten egg around the edges and fold the pastry again to encase the filling. Use a fork to seal the edges all the way around, then brush all over with more egg. Poke a few air holes in the top with the fork. Repeat with the remaining pastry and filling. Arrange the pop pies on a baking sheet lined with baking parchment and chill for at least 30 mins, or for up to 24 hrs. Alternatively freeze for up to 2 months.\n\n3. Heat oven to 200C/180C fan/gas 6. Bake the pop pies for 20 mins, or until the pastry is golden and the filling is bubbling through the holes. Remove from the oven and cool for at least 20 mins. If cooking from frozen, bake for an extra 5 mins. Meanwhile crush the remaining raspberries until juicy and mix with the icing sugar to make a thick icing. Spread thinly over the pies and sprinkle with freeze dried raspberries or sprinkles, if you like. Eat warm, or cold, for breakfast or drizzle with cream or custard for dessert.",
      "image": "https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/07/pop-tarts.jpg?itok=fhwxHkU4"
    },
    {
      "name": "Baked almond, banana & blueberry cheesecake",
      "ingredients": "50g butter, plus a little for greasing\n\n1 tsp maple syrup\n\n75g oatcakes, finely crushed to crumbs\n\n40g ground almond\n\n2 bananas\n\n2 x 250g tubs ricotta\n\n150g pot natural bio yogurt\n\n4 large eggs, beaten\n\n2 tbsp maple syrup\n\n2 tsp vanilla extract\n\n2 tbsp ground almonds\n\n140g blueberries",
      "method": "1. Heat oven to 180C/160C fan/gas 4 and lightly grease a 20cm round non-stick springform cake tin. Melt the butter and syrup in a pan, then stir in the oatcakes and almonds until well mixed and coated. Press firmly into the base of the tin to make a compact layer, then bake for 10 mins. Remove from the oven and increase it to 240C/220C fan/gas 9.\n\n2. To make the filling, mash the bananas in a large bowl. Add the ricotta, yogurt, eggs, syrup, vanilla and almonds, and beat with a wooden spoon until everything is very well mixed. Pour onto the base, scatter over the blueberries and bake for 10 mins, then turn the oven down to 110C/90C fan/gas 1 /4 and cook for 30-35 mins more. It should still have a bit of wobble in the middle when you gently shake the tin. Turn off the oven and leave the cheesecake inside to cool and set. Chill before serving.",
      "image": "https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe/recipe-image/2016/05/baked-almond-banana-blueberry-cheesecake.jpg?itok=ipxxVngc"
    },
    {
      "name": "Hazelnut brownies",
      "ingredients": "box of 16 Ferrero Rocher chocolates\n\n250g pack salted butter, plus extra for greasing\n\n250g golden caster sugar\n\n225g light muscovado sugar\n\n100g cocoa powder\n\n4 large eggs\n\n100g self-raising flour\n\n85g ready-chopped hazelnuts\n\n4 tbsp Frangelico or Fratello hazelnut liqueur (or Disaronno)",
      "method": "1. Unwrap the chocolates, place on a tray and pop in the freezer. Heat oven to 180C/160C fan/gas 4. Lightly grease and line the base and sides of a 21-22cm square tin with baking parchment.\n\n2. Put the butter, sugars and cocoa into your largest saucepan and gently melt together, stirring regularly so the mixture doesn’t catch. Once the sugar granules have just about disappeared, take off the heat, tip into a bowl and leave to cool for 5 mins.\n\n3. Use a whisk or wooden spoon to beat the eggs, one by one, into the mixture. When they’re completely incorporated and the mixture is smooth and shiny, stir in the flour, hazelnuts and liqueur. Tip the mixture into the prepared tin and bake for 35 mins.\n\n4. Remove the tin from the oven and use a cutlery knife to mark the top of the brownies into 16 squares (don’t cut through, it’s just as a guide). Use a teaspoon to push a little dent in the centre of each portion and add a frozen Ferrero Rocher chocolate into each dip. Return to the oven for 3 mins, then remove and leave to cool completely.\n\n5. Once cool, cut into 16 squares. Will keep for 3 days in an airtight container.",
      "image": "https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/hazelnut-brownies.jpg?itok=sjygr9gW"
    },
    {
      "name": "Chocolate marble cake",
      "ingredients": "225g butter, softened\n\n225g caster sugar\n\n4 eggs\n\n225g self-raising flour\n\n3 tbsp milk\n\n1 tsp vanilla extract\n\n2 tbsp cocoa powder",
      "method": "1. Heat oven to 180C/gas 160C/gas 4. Grease a 20cm cake tin and line the bottom with a circle of greaseproof paper. If you want to make life easy, simply put all the ingredients (except the cocoa powder) into a food processor and whizz for 1-2 mins until smooth. If you prefer to mix by hand, beat the butter and sugar together, then add the eggs, one at a time, mixing well after each addition. Fold through the flour, milk and vanilla extract until the mixture is smooth.\n\n2. Divide the mixture between 2 bowls. Stir the cocoa powder into the mixture in one of the bowls. Take 2 spoons and use them to dollop the chocolate and vanilla cake mixes into the tin alternately. When all the mixture has been used up (and if young kids are doing this, you’ll need to ensure the base of the tin is fairly evenly covered), tap the bottom on your work surface to ensure that there aren’t any air bubbles. Take a skewer and swirl it around the mixture in the tin a few times to create a marbled effect.\n\n3. Bake the cake for 45-55 mins until a skewer inserted into the centre comes out clean. Turn out onto a cooling rack and leave to cool. Will keep for 3 days in an airtight container or freeze for up to 3 months.",
      "image": "https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363765_11.jpg?itok=Y0IAzwXZ"
    },
    {
      "name": "Cherry Bakewell cake",
      "ingredients": "200g butter, well softened, plus extra for greasing\n\n200g golden caster sugar\n\n100g ground almond\n\n100g self-raising flour\n\n1 tsp baking powder\n\n½ tsp almond extract or essence\n\n4 large eggs\n\n½ a 340g jar morello cherry conserve\n\n175g icing sugar\n\n5-6 tsp water or lemon juice\n\n1 tbsp ready-toasted flaked almonds",
      "method": "1. Heat oven to 180C/fan 160C/gas 4 and make sure there’s a shelf ready in the middle. Butter and line the bases of 2 x 20cm round sandwich tins with baking paper.\n\n2. Using electric beaters, beat together all the cake ingredients with a pinch of salt until smooth, then spoon into the tins and level the tops. Bake for 30 mins or until golden and springy. Don’t open the oven before 25 mins cooking time has passed.\n\n3. When they’re ready, cool the sponges for a few mins, then tip out of the tins and cool completely on a wire rack. Make sure the top of one of the cakes is facing up as you’ll want a smooth surface for the icing later on.\n\n4. When cool, put one sponge on a serving plate, then spread with jam. Sandwich the second sponge on top. Sieve the icing sugar into a large bowl. Add the water or lemon juice, then stir until smooth and thick. Spread evenly over the top and let it dribble over the sides. Scatter with the nuts and leave to set for a few mins before cutting.",
      "image": "https://www.bbcgoodfood.com/sites/default/files/styles/recipe/public/recipe_images/recipe-image-legacy-id--363595_11.jpg?itok=9T1S3PBC"
    }
  ]
}
